In [1]:
import pandas as pd

In [3]:
# pd.to_datetime

In [5]:
data = {"Event": ["A", "B", "C"], "Date": ["2023-05-12", "2022-11-30", "2021-07-25"]}

In [7]:
df = pd.DataFrame(data)

In [9]:
df

  Event        Date
0     A  2023-05-12
1     B  2022-11-30
2     C  2021-07-25

In [11]:
df.dtypes

Event    object
Date     object
dtype: object

In [13]:
df["Date"] = pd.to_datetime(df["Date"])
df

  Event       Date
0     A 2023-05-12
1     B 2022-11-30
2     C 2021-07-25

In [15]:
df.dtypes

Event            object
Date     datetime64[ns]
dtype: object

In [17]:
# Extract ==> Year , Month , Date , Day

In [35]:
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df['Day'] = df['Date'].dt.day
df['Day_Name'] = df['Date'].dt.day_name()

In [37]:
df

  Event       Date  Year  Month  Day   Day_Name
0     A 2023-05-12  2023      5   12     Friday
1     B 2022-11-30  2022     11   30  Wednesday
2     C 2021-07-25  2021      7   25     Sunday

In [39]:
# pd.DateOffset(days=?)

In [41]:
# Adding and subtracting days
df["Date Offset after 10 days"] = df["Date"] + pd.DateOffset(days=10)
df["Date offset before 5 days"] = df["Date"] - pd.DateOffset(days=5)
df

,Event,Date,Year,Month,Day,Day_Name,Date Offset after 10 days,Date offset before 5 days
0,A,2023-05-12,2023,5,12,Friday,2023-05-22,2023-05-07
1,B,2022-11-30,2022,11,30,Wednesday,2022-12-10,2022-11-25
2,C,2021-07-25,2021,7,25,Sunday,2021-08-04,2021-07-20

In [51]:
# Define date range
start_date = "2020-01-01"
end_date = "2023-01-01"

In [57]:
# Filter DataFrame
filtered_df = df[(df["Date"] >= start_date) & (df["Date"] <= end_date)]

In [59]:
filtered_df

,Event,Date,Year,Month,Day,Day_Name,Date Offset after 10 days,Date offset before 5 days
1,B,2022-11-30,2022,11,30,Wednesday,2022-12-10,2022-11-25
2,C,2021-07-25,2021,7,25,Sunday,2021-08-04,2021-07-20

In [63]:
# Sample DataFrame with Unix timestamps
data = {"Timestamp": [1672527600, 1640991600, 1609455600]}  # Epoch time

df = pd.DataFrame(data)

# Convert Unix timestamp to datetime
df["DateTime"] = pd.to_datetime(df["Timestamp"], unit="s")

df

    Timestamp            DateTime
0  1672527600 2022-12-31 23:00:00
1  1640991600 2021-12-31 23:00:00
2  1609455600 2020-12-31 23:00:00

In [65]:
# Get current date and time
current_time = pd.to_datetime("today")

current_time

Timestamp('2025-08-19 09:52:46.684795')

In [67]:
# Concatenation in Pandas
# Syntax : pd.concat

In [69]:
# Creating first DataFrame
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40]
})

# Creating second DataFrame
df2 = pd.DataFrame({
    'ID': [5, 6, 7, 8],
    'Name': ['Rutul', 'Mohit', 'Dhruv', 'Meet'],
    'Age': [22, 21, 23, 22]
})

In [71]:
df1

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40

In [73]:
df2

   ID   Name  Age
0   5  Rutul   22
1   6  Mohit   21
2   7  Dhruv   23
3   8   Meet   22

In [85]:
pd.concat([df1,df2],ignore_index=True)

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40
4   5    Rutul   22
5   6    Mohit   21
6   7    Dhruv   23
7   8     Meet   22